# 7.1 Цикл for

> *Здесь находятся задачи по теме "Цикл `for`"*

[Справка по теме в Wiki](https://github.com/aalutsenko/Training/wiki/7.1-Цикл-for)

## 7.1.1 Python is awesome

### 7.1.1 Условие задачи  

Напишисать программу, которая выводит слова «`Python is awesome!`» (без кавычек) 10 раз.

**Формат входных данных:**  
В первой строке записано текстовое предложение, во второй — количество повторений.

**Формат выходных данных:**  
Программа должна вывести 10 раз текст «`Python is awesome!`», каждый на отдельной строке.  

### 7.1.1 Решение  

Файл [7.1.1_Python_is_awesome.py](7.1.1_Python_is_awesome.py)

```python
for i in range(10):
    print('Python is awesome!')
```

## 7.1.2 Повторяй за мной 1

### 7.1.2 Условие задачи  

Дано предложение и количество раз которое его надо повторить. Напишисать программу, которая повторяет данное предложение нужное количество раз.

**Формат входных данных:**  
В первой строке записано текстовое предложение, во второй — количество повторений.

**Формат выходных данных:**  
Программа должна вывести указанное текстовое предложение нужное количество раз. Каждое повторение должно начинаться с новой строки.  

### 7.1.2 Решение  

Файл [7.1.2_Repeat_after_me_1.py](7.1.2_Repeat_after_me_1.py)

```python
s, num = input(), int(input())
for i in range(num):
    print(s)
```

## 7.1.3 Последовательность символов

### 7.1.3 Условие задачи  

Напишите программу, которая использует ровно три цикла `for` для печати следующей последовательности символов:

```python
AAA
AAA
AAA
AAA
AAA
AAA
BBBB
BBBB
BBBB
BBBB
BBBB
E
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
TTTTT
G
```

**Формат входных данных:**  

**Формат выходных данных:**  
Программа должна вывести указанную последовательность символов.  

### 7.1.3 Решение  

Файл [7.1.3_Character_sequence.py](7.1.3_Character_sequence.py)

```python
for i in range(6):
    print('AAA')
for i in range(5):
    print('BBBB')
print('E')
for i in range(9):
    print('TTTTT')
print('G')
```

## 7.1.4 Звездный прямоугольник

### 7.1.4 Условие задачи  

На вход программе подается натуральное число `n`.
Напишисать программу, которая печатает звездный прямоугольник размерами n×19.

**Формат входных данных:**  

На вход программе подаётся натуральное число `n ∈ [1;20]` — высота звездного прямоугольника.

**Формат выходных данных:**  
Программа должна вывести звездный прямоугольник размерами n×19.  
> **Подсказка:** *Для печати звездной линии используйте умножение строки на число.*  

### 7.1.4 Решение  

Файл [7.1.4_Star_Rectangle.py](7.1.4_Star_Rectangle.py)

```python
n = int(input())
for i in range(n):
    print('*' * 19)
```

## 7.1.5 Повторяй за мной 2

### 7.1.5 Условие задачи  

Напишите программу, которая считывает одну строку текста и выводит 10 строк, пронумерованных от 0 до 9, каждая с указанной строкой текста.

**Формат входных данных:**  

На вход программе подается одна строка текста.

**Формат выходных данных:**  
Программа должна вывести десять строк в соответствии с условием задачи.

### 7.1.5 Решение  

Файл [7.1.5_Repeat_after_me_2.py](7.1.5_Repeat_after_me_2.py)

```python
s = input()
for i in range(10):
    print(i, s)
```

## 7.1.6 Квадрат числа

### 7.1.6 Условие задачи  

На вход программе подается натуральное число nn. Напишите программу, которая для каждого из чисел от `0` до `n` (включительно) выводит фразу: «`Квадрат числа [число] равен [число]`» (без кавычек).

**Формат входных данных:**  

На вход программе подается натуральное число `n`.

**Формат выходных данных:**  
Программа должна вывести текст в соответствии с условием задачи

### 7.1.6 Решение  

Файл [7.1.6_The_square_of_the_number.py](7.1.6_The_square_of_the_number.py)

```python
n = int(input())
for i in range(n):
    print('Квадрат числа', i, 'равен', i**2)
print('Квадрат числа', i+1, 'равен', (i+1)**2)
```

## 7.1.7 Звездный треугольник

### 7.1.7 Условие задачи  

На вход программе подается натуральное число `n` (n≥2) – катет прямоугольного равнобедренного треугольника.

Напишисать программу, которая выводит звездный треугольник в соответствии с примером.

**Формат входных данных:**  

На вход программе подается одно натуральное число `n` (n≥2).

**Формат выходных данных:**  
Программа должна вывести треугольник в соответствии с условием задачи

### 7.1.7 Решение  

Файл [7.1.7_The_Star_Triangle.py](7.1.7_The_Star_Triangle.py)

```python
n = int(input())
for i in range(n):
    print('*' * n)
    n = n - 1
```

Результат при `n = 11`:

```python
***********
**********
*********
********
*******
******
*****
****
***
**
*
```

