# 7.2 Цикл for: функция range

> *Здесь находятся задачи по теме "Цикл `for`, функция `range`*  

[Справка по теме в Wiki](https://github.com/aalutsenko/Training/wiki/7.2-Цикл-for_функция-range)  

## 7.2.1 Последовательность чисел

### 7.2.1 Условия задачи

Даны два целых числа `m` и `n` ( m ≤n ). Напишите программу, которая выводит все числа от `m` до `n` включительно.

**Формат входных данных**  
На вход программе подаются два целых числа `m` и `n`, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

### 7.2.1 Решение

Файл [7.2.1_Sequence_of_numbers.py](7.2.1_Sequence_of_numbers.py)

```python
m, n = int(input()), int(input())
for i in range(m, n + 1):
    print(i)
```

**Результат**  
При `m = 1`, `n = 9`

```python
1
2
3
4
5
6
7
8
9
```

## 7.2.2 Последовательность чисел 2

### 7.2.2 Условия задачи

Даны два целых числа `m` и `n`. Напишите программу, которая выводит все числа от `m` до `n` включительно в порядке возрастания, если `m` < `n`, или в порядке убывания в противном случае.

**Формат входных данных**  
На вход программе подаются два целых числа `m` и `n`, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

### 7.2.2 Решение

Файл [7.2.2_Sequence_of_numbers_2.py](7.2.2_Sequence_of_numbers_2.py)

```python
m, n = int(input()), int(input())
if m > n:
    for i in range(m, n - 1, -1):
        print(i)
else:
    for i in range(m, n + 1, 1):
        print(i)
```

**Результат**  
При `m = 1`, `n = 5`

```python
1
2
3
4
5
```

При `m = 7`, `n = 1`

```python
7
6
5
4
3
2
1
```

## 7.2.3 Последовательность чисел 3

### 7.2.3 Условия задачи

Даны два целых числа `m` и `n` (m > n). Напишите программу, которая выводит все нечетные числа от `m` до `n` включительно в порядке убывания.

**Формат входных данных**  
На вход программе подаются два целых числа `m` и `n`, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

### 7.2.3 Решение

Файл [7.2.3_Sequence_of_numbers_3.py](7.2.3_Sequence_of_numbers_3.py)

```python
m, n = int(input()), int(input())
if m%2 == 0:
    m = m - 1
else:
    m = m
for i in range(m, n-1, -2):
    print(i)
```

**Результат**  
При `m = 77`, `n = 62`

```python
77
75
73
71
69
67
65
63
```

При `m = 6`, `n = -2`

```python
5
3
1
-1
```

## 7.2.4 Последовательность чисел 4

### 7.2.4 Условия задачи

Даны два натуральных числа `m` и `n` (m ≤ n). Напишите программу, которая выводит все числа от `m` до `n` включительно удовлетворяющие хотя бы одному из условий:

- число кратно 17;
- число оканчивается на 9;
- число кратно 3 и 5 одновременно.

**Формат входных данных**  
На вход программе подаются два натуральных числа `m` и `n` (m ≤ n), каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.  
>**Примечание.** Если чисел удовлетворяющих условию нет, выводить ничего не надо.

### 7.2.4 Решение

Файл [7.2.4_Sequence_of_numbers_4.py](7.2.4_Sequence_of_numbers_4.py)

```python
m, n = int(input()), int(input())
for i in range(m, n + 1):
    if i%17 == 0 or i%10 == 9 or (i%3 == 0 and i%5 == 0):
        print(i)
```

**Результат**  
При `m = 1`, `n = 20`

```python
9
15
17
19
```

При `m = 1`, `n = 51`

```python
9
15
17
19
29
30
34
39
45
49
51
```

## 7.2.5 Таблица умножения

### 7.2.5 Условия задачи

Дано натуральное число `n`. Напишите программу, которая выводит таблицу умножения на `n`.

**Формат входных данных**  
На вход программе подается натуральное число.

**Формат выходных данных**  
Программа должна вывести таблицу умножения на введенное число.  
> **Примечание.** В качестве знака умножения используйте английскую букву `x`.

### 7.2.5 Решение

Файл [7.2.5_Multiplication_table.py](7.2.5_Multiplication_table.py)

```python
n = int(input())
for i in range(1, 11):
    print(n, 'x', i, '=', n * i)
```

**Результат**  
При `n = 4`

```python
4 x 1 = 4
4 x 2 = 8
4 x 3 = 12
4 x 4 = 16
4 x 5 = 20
4 x 6 = 24
4 x 7 = 28
4 x 8 = 32
4 x 9 = 36
4 x 10 = 40
```

При `n = 5`

```python
5 x 1 = 5
5 x 2 = 10
5 x 3 = 15
5 x 4 = 20
5 x 5 = 25
5 x 6 = 30
5 x 7 = 35
5 x 8 = 40
5 x 9 = 45
5 x 10 = 50
```