# 7.2 Цикл for: функция range

> *Здесь находятся задачи по теме "Цикл `for`, функция `range`*  

[Справка по теме в Wiki](https://github.com/aalutsenko/Training/wiki/7.2-Цикл-for_функция-range)  

## 7.2.1 Последовательность чисел

### 7.2.1 Условия задачи

Даны два целых числа `m` и `n` ( m ≤n ). Напишите программу, которая выводит все числа от `m` до `n` включительно.

**Формат входных данных**  
На вход программе подаются два целых числа `m` и `n`, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

### Решение

Файл [7.2.1_Sequence_of_numbers.py](7.2.1_Sequence_of_numbers.py)

```python
m, n = int(input()), int(input())
for i in range(m, n + 1):
    print(i)
```

**Результат**
При m = 1, n = 9

```python
1
2
3
4
5
6
7
8
9
```
