# 7.2 Цикл for: функция range

> *Здесь находятся задачи по теме "Цикл `for`, функция `range`*  

[Справка по теме в Wiki](https://github.com/aalutsenko/Training/wiki/7.2-Цикл-for_функция-range)  

## 7.2.1 Последовательность чисел

### 7.2.1 Условия задачи

Даны два целых числа `m` и `n` ( m ≤n ). Напишите программу, которая выводит все числа от `m` до `n` включительно.

**Формат входных данных**  
На вход программе подаются два целых числа `m` и `n`, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

### 7.2.1 Решение

Файл [7.2.1_Sequence_of_numbers.py](7.2.1_Sequence_of_numbers.py)

```python
m, n = int(input()), int(input())
for i in range(m, n + 1):
    print(i)
```

**Результат**  
При `m = 1`, `n = 9`

```python
1
2
3
4
5
6
7
8
9
```

## 7.2.2 Последовательность чисел

### 7.2.2 Условия задачи

Даны два целых числа `m` и `n`. Напишите программу, которая выводит все числа от `m` до `n` включительно в порядке возрастания, если `m` < `n`, или в порядке убывания в противном случае.

**Формат входных данных**  
На вход программе подаются два целых числа `m` и `n`, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

### 7.2.2 Решение

Файл [7.2.2_Sequence_of_numbers_2.py](7.2.2_Sequence_of_numbers_2.py)

```python
m, n = int(input()), int(input())
if m > n:
    for i in range(m, n - 1, -1):
        print(i)
else:
    for i in range(m, n + 1, 1):
        print(i)
```

**Результат**  
При `m = 1`, `n = 5`

```python
1
2
3
4
5
```

При `m = 7`, `n = 1`

```python
7
6
5
4
3
2
1
```

## 7.2.3 Последовательность чисел

### 7.2.3 Условия задачи

Даны два целых числа `m` и `n` (m > n). Напишите программу, которая выводит все нечетные числа от `m` до `n` включительно в порядке убывания.

**Формат входных данных**  
На вход программе подаются два целых числа `m` и `n`, каждое на отдельной строке.

**Формат выходных данных**  
Программа должна вывести числа в соответствии с условием задачи.

### 7.2.3 Решение

Файл [7.2.3_Sequence_of_numbers_3.py](7.2.3_Sequence_of_numbers_3.py)

```python
m, n = int(input()), int(input())
if m%2 == 0:
    m = m - 1
else:
    m = m
for i in range(m, n-1, -2):
    print(i)
```

**Результат**  
При `m = 77`, `n = 62`

```python
77
75
73
71
69
67
65
63
```

При `m = 6`, `n = -2`

```python
5
3
1
-1
```
