# 7.3 Частые сценарии

> *Здесь находятся задачи по теме "Частые сценарии*  

[Справка по теме в Wiki](https://github.com/aalutsenko/Training/wiki/7.3-Частые-сценарии)  

## 7.3.1 Количество чисел

### 7.3.1 Условия задачи

На вход программе подаются два целых числа `a` и `b` (a ≤ b). Напишите программу, которая подсчитывает количество чисел в диапазоне от `a` до `b` включительно, куб которых оканчивается на `4` или `9`.

**Формат входных данных**  
На вход программе подаются два целых числа `a` и `b` (a ≤ b).

**Формат выходных данных**  
Программа должна вывести одно целое число в соответствии с условием программы.
> **Примечание.** Куб числа `a` – это его третья степень `a**3`.

### 7.3.1 Решение

Файл [7.3.1_Number_of_numbers.py](7.3.1_Number_of_numbers.py)

```python
counter = 0
a, b = int(input()), int(input())
for i in range(a, b + 1):
    if pow(i, 3)%10 == 4 or pow(i, 3)%10 == 9:
        counter += 1
print(counter)
```

**Результат**  
При `a = 10`, `b = 1786`

```python
355
```

## 7.3.2 Сумма чисел

### 7.3.2 Условия задачи

На вход программе подается натуральное число `n`, а затем `n` целых чисел, каждое на отдельной строке. Напишите программу, которая подсчитывает сумму введенных чисел. 

**Формат входных данных:**
На вход программе подаются натуральное число `n`, а затем `n` целых чисел, каждое на отдельной строке.

**Формат выходных данных^**
Программа должна вывести сумму данных чисел.

### 7.3.2 Решение

Файл [7.3.2_Sum_of_numbers.py](7.3.2_Sum_of_numbers.py)

```python
n = int(input())
s = 0
for i in range(n):
    s += int(input())
print(s)
```

**Результат**
При `n = 5` и

```python
3
2
1
0
-1
```

```python
5
```

