# 7.3 Частые сценарии

> *Здесь находятся задачи по теме "Частые сценарии*  

[Справка по теме в Wiki](https://github.com/aalutsenko/Training/wiki/7.3-Частые-сценарии)  

## 7.3.1 Количество чисел

### 7.3.1 Условия задачи

На вход программе подаются два целых числа `a` и `b` (a ≤ b). Напишите программу, которая подсчитывает количество чисел в диапазоне от `a` до `b` включительно, куб которых оканчивается на `4` или `9`.

**Формат входных данных**  
На вход программе подаются два целых числа `a` и `b` (a ≤ b).

**Формат выходных данных**  
Программа должна вывести одно целое число в соответствии с условием программы.
> **Примечание.** Куб числа `a` – это его третья степень `a**3`.

### 7.3.1 Решение

Файл [7.3.1_Number_of_numbers.py](7.3.1_Number_of_numbers.py)

```python
counter = 0
a, b = int(input()), int(input())
for i in range(a, b + 1):
    if pow(i, 3)%10 == 4 or pow(i, 3)%10 == 9:
        counter += 1
print(counter)
```

**Результат**  
При `a = 10`, `b = 1786`

```python
355
```

## 7.3.2 Сумма чисел

### 7.3.2 Условия задачи

На вход программе подается натуральное число `n`, а затем `n` целых чисел, каждое на отдельной строке. Напишите программу, которая подсчитывает сумму введенных чисел. 

**Формат входных данных:**  
На вход программе подаются натуральное число `n`, а затем `n` целых чисел, каждое на отдельной строке.

**Формат выходных данных:**  
Программа должна вывести сумму данных чисел.

### 7.3.2 Решение

Файл [7.3.2_Sum_of_numbers.py](7.3.2_Sum_of_numbers.py)

```python
n = int(input())
s = 0
for i in range(n):
    s += int(input())
print(s)
```

**Результат**  
При `n = 5` и

```python
3
2
1
0
-1
```

```python
5
```

## 7.3.3 Асимптотическое приближение

### 7.3.3 Условия задачи

На вход программе подается натуральное число `n`. Напишите программу, которая вычисляет значение выражения
`(1 + 1/2 + 1/3 + ... + 1/n) - log(n)`
> **Примечание.** Для вычисления натурального логарифма воспользуйтесь функцией log(n), которая находится в модуле math.

**Формат входных данных:**

**Формат выходных данных:**  
Программа должна вывести значение выражения.

### 7.3.3 Решение

Файл [7.3.3_Asymptotic_approximation.py](7.3.3_Asymptotic_approximation.py)

```python
from math import *
n = int(input())
s = 0
for i in range(1, n + 1):
    s += (1 / i)
print(s - log(n))
```

**Результат**  
При `n = 100`  

```python
0.5822073316515288
```

## 7.3.4 Сумма чисел 2

### 7.3.4 Условия задачи

На вход программе подается натуральное число `n`. Напишите программу, которая подсчитывает сумму тех чисел от `1` до `n` (включительно) квадрат которых оканчивается на `2`, `5` или `8`.

**Формат входных данных:**  

На вход программе подается натуральное число `n`.

**Формат выходных данных:**  
Программа должна вывести единственное число в соответствии с условием задачи.  
> **Примечание.** Если таких чисел нет в указанном диапазоне, то следует вывести `0`.

### 7.3.4 Решение

Файл [7.3.4_The_sum_of_the_numbers_2.py](7.3.4_The_sum_of_the_numbers_2.py)

```python
n = int(input())
s = 0
for i in range(1, n +1):
    if i**2%10 == 2 or i**2%10 == 5 or i**2%10 == 8:
        s += i
print(s)
```

**Результат**  
При `n = 1992`  

```python
198005
```

При `n = 4`

```python
0
```

## 7.3.5 Факториал

### 7.3.5 Условия задачи

На вход программе подается натуральное число `n`. Напишите программу, которая вычисляет `n!`.  

**Формат входных данных:**  

На вход программе подается натуральное число `n` (n ≤ 12).

**Формат выходных данных:**  
Программа должна вывести единственное число в соответствии с условием задачи.  
> **Примечание.** Факториалом натурального числа nn, называется произведение всех натуральных чисел от `1` до `n`, то есть
> `n! = 1 * 2 * 3 * … * n`

### 7.3.5 Решение

Файл [7.3.5_Factorial.py](7.3.4_Factorial.py)

```python
from math import *
n = int(input())
print(factorial(n))
```

**Результат**  
При `n = 3`  

```python
6
```

При `n = 2`

```python
2
```

## 7.3.6 Без нулей

### 7.3.6 Условия задачи

Напишите программу, которая считывает 10 чисел и выводит произведение отличных от нуля чисел.  

**Формат входных данных:**  

На вход программе подаются 10 целых чисел, каждое на отдельной строке.

**Формат выходных данных:**  
Программа должна вывести произведение отличных от нуля чисел.
> **Примечание.** Гарантируется, что хотя бы одно из 10 чисел является ненулевым.  

### 7.3.6 Решение

Файл [7.3.6_Without_zeros.py](7.3.6_Without_zeros.py)

```python
s = 1
for _ in range(10):
    x = int(input())
    if x != 0:
        s *= x
print(s)
```

При

```python
3
8
66
1110
4
2
2
1
0
0
```

Результат:  

```python
28131840
```

## 7.3.7 Сумма делителей

### 7.3.7 Условия задачи

На вход программе подается натуральное число `n`. Написать программу, которая вычисляет сумму всех его делителей.  

**Формат входных данных:**  

На вход программе подается натуральное число `n`.

**Формат выходных данных:**  
Программа должна вывести единственное число в соответствии с условием задачи.  
> **Примечание.** Функция подсчета суммы всех делителей числа является очень важной в теории чисел.  

### 7.3.7 Решение

Файл [7.3.7_Sum of divisors.py](7.3.7_Sum of divisors.py)

```python
n = int(input())
s = 0
for i in range(1, n + 1):
    if n % i == 0:
        s += i
print(s)
```

При `n = 10`

Результат:  

```python
18
```

При `n = 50`

Результат:  

```python
93
```